Revit 2027 API
StructuralAsset.MetalReductionFactor Property
 The reduction factor of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MetalReductionFactor { get; set; }
Public Property MetalReductionFactor As Double
	Get
	Set
public:
property double MetalReductionFactor {
	double get ();
	void set (double value);
}
member MetalReductionFactor : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InapplicableDataException |  When setting this property: the material type must be Metal to set this property.
Remarks
 Applies to Metal-based structural assets.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace